---
kind: property
id: P:Autodesk.Revit.DB.PrintSetting.PrintParameters
source: html/1238672f-fa00-4d80-50fd-3278c46411ad.htm
---
# Autodesk.Revit.DB.PrintSetting.PrintParameters Property

Returns the Parameters of Print Setup.

## Syntax (C#)
```csharp
public virtual PrintParameters PrintParameters { get; }
```

## Remarks
The Parameters of Print Setup. Refer to the Print Setup dialog in Revit for details.